---
kind: method
id: M:Autodesk.Revit.UI.IFrameworkElementCreator.CreateFrameworkElement
source: html/23563954-f445-7fee-916f-75584b846f0e.htm
---
# Autodesk.Revit.UI.IFrameworkElementCreator.CreateFrameworkElement Method

Method called to create the FrameworkElement.

## Syntax (C#)
```csharp
FrameworkElement CreateFrameworkElement()
```